#include <stdio.h>
#include <locale.h>

int main() 
{
	setlocale(LC_ALL, "RUS");
	printf("%d\n\t%d\n\t\t%d\n", 1, 2, 3); // подзадание 1
	printf("%10.5f\n", 12.234657);
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Деление 7 на 5: %d\n", 7 / 5);
	printf("Умножение 2000 на 4: %\d\n", 2000 * 4);
	printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);
}